app/controllers/manufacturers_controller.rb

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)

    respond_to do |format|
      if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "street_address", "city", "state", "postal_code", "country_or_region", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @manufacturer.update(manufacturer_params)
---
UPDATE "manufacturers" SET "country_or_region" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["country_or_region", "Canada"], ["updated_at", "2020-11-17 05:01:58.289950"], ["id", 1]]

    def set_manufacturer
      @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]