app/controllers/products_controller.rb

  def index
    @products = Product.where(nil) # creates an anonymous scope
    @products = @products.filter_by_barcode(params[:barcode].to_i) if params[:barcode].present?
---
SELECT "products".* FROM "products" WHERE (CAST(barcode AS CHAR) like '89%')
SELECT "products".* FROM "products" WHERE "products"."barcode" = ?  [["barcode", 6672765983]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "barcode", "manufacturer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Zumi"], ["barcode", 1234567890], ["manufacturer_id", 1], ["created_at", "2021-04-11 03:38:47.095341"], ["updated_at", "2021-04-11 03:38:47.095341"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "barcode" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["barcode", 1265348966], ["updated_at", "2020-11-17 04:23:47.775439"], ["id", 1]]