app/controllers/security_and_privacy_vulnerabilities_controller.rb

SELECT "security_and_privacy_vulnerabilities".* FROM "security_and_privacy_vulnerabilities"
---
  def index
    @security_and_privacy_vulnerabilities = SecurityAndPrivacyVulnerability.all

INSERT INTO "security_and_privacy_vulnerabilities" ("product_id", "cve_id", "severity", "description", "advisories", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @security_and_privacy_vulnerability = SecurityAndPrivacyVulnerability.new(security_and_privacy_vulnerability_params)

    respond_to do |format|
      if @security_and_privacy_vulnerability.save

UPDATE "security_and_privacy_vulnerabilities" SET "cve_id" = ?, "updated_at" = ? WHERE "security_and_privacy_vulnerabilities"."id" = ?  [["cve_id", "CVE-2015-3434"], ["updated_at", "2020-11-17 04:58:47.933380"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @security_and_privacy_vulnerability.update(security_and_privacy_vulnerability_params)

SELECT  "security_and_privacy_vulnerabilities".* FROM "security_and_privacy_vulnerabilities" WHERE "security_and_privacy_vulnerabilities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_security_and_privacy_vulnerability
      @security_and_privacy_vulnerability = SecurityAndPrivacyVulnerability.find(params[:id])