app/views/products/show.html.erb

SELECT "security_and_privacy_vulnerabilities".* FROM "security_and_privacy_vulnerabilities" WHERE "security_and_privacy_vulnerabilities"."product_id" = ?  [["product_id", 1]]
---
</tr>
<% @product.security_and_privacy_vulnerabilities.each do |security_and_privacy_vulnerability| %>